#+BEGIN_COMMENT
.. title: Dogs Vs Cats With Transfer Learning
.. slug: dogs-vs-cats-with-transfer-learning
.. date: 2019-07-29 14:08:59 UTC-07:00
.. tags: cnn,transfer learning
.. category: Transfer Learning
.. link: 
.. description: Re-visiting the dogs vs cats problem using transfer learning.
.. type: text

#+END_COMMENT
#+OPTIONS: ^:{}
#+TOC: headlines 3
#+begin_src ipython :session cnn :results none :exports none
%load_ext autoreload
%autoreload 2
#+end_src
*** The Datasets
#+begin_src ipython :session cnn :results output :exports both
environment = SubPathLoader("DATASETS")
base_path = Path(environment["DOGS_VS_CATS"]).expanduser()
for item in base_path.iterdir():
    print(item)
#+end_src

#+RESULTS:
: I0801 15:14:11.707943 140287413491520 environment.py:35] Environment Path: /home/brunhilde/.env
: I0801 15:14:11.709249 140287413491520 environment.py:90] Environment Path: /home/brunhilde/.datasets
: /home/brunhilde/data/datasets/images/dogs-vs-cats/test
: /home/brunhilde/data/datasets/images/dogs-vs-cats/train

#+begin_src ipython :session cnn :results output :exports both
training_path = base_path/"train"
testing_path = base_path/"test"
for item in training_path.iterdir():
    print(item)
#+end_src

#+RESULTS:
: /home/brunhilde/data/datasets/images/dogs-vs-cats/train/cat
: /home/brunhilde/data/datasets/images/dogs-vs-cats/train/dog

**Note:** The download from kaggle has all the training files in one folder with the files labeled with either cat or dog, I made the subfolders and moved the files to make it work better with the Data Generator.

